phone_book = {                         # Створення словника (ключ = ім'я, значення = номер)
    "Тереза": "+380 123 456 789",
    "Денис": "+380 523 476 889",
    "Влад": "+380 567 443 231",
}

print("Список контактів у книзі:")
for name in phone_book:                # Виведення списку всіх наявних контактів перед початком циклу
    print("=-=-=-" * 2)
    print(name)
    print("=-=-=-" * 2)

while True:                            # Нескінченний цикл для зручного пошуку декількох контактів
    # Запит імені + .capitalize() для автоматичного перетворення першої літери у велику
    choice = input("\nВітаю, кому сьогодні дзвонимо? \n:> ").capitalize()

    if choice in phone_book:           # Перевірка наявності імені (ключа) в телефонній книзі
        # Якщо знайдено виводимо номер телефону, звертаючись за ключем: phone_book[choice]
        print(f'Гаразд, дзвонимо {choice}: {phone_book[choice]}')
    else:
        print('Контакт не знайдено')   # Якщо контакту в словнику немає  виводимо повідомлення за ТЗ
        
    print("=-=-=-" * 2) 
    
    x = input("Дзвонимо ще комусь? (так/ні)\n:> ").lower() # Запит користувача щодо продовження циклу
    
    if x in ["ні", "н", "n", "no"]:   # Перевірка на варіанти відмови для виходу з циклу через break
        print("До зустрічі!")
        break
        
# ПОЯСНЕННЯ : Словники ідеальні для телефонної книги, бо пошук значення за ключем 
# відбувається миттєво (за 1 крок), без послідовного перебору всіх елементів, як у списках.