import datetime

while True:
    
    print("1. додати нотатку. \n2. Показати всі нотатки. \n3. Показати нотатки по рядках. \n4. Вийти. \n=--==-=-=-==--=")
    choice = input(":>")

    if choice == "4":
        print("здійснено: Вихід")
        break

    elif choice == "1":
        text = input("що бажаєте занотувати? \n:>")
        time_now = datetime.datetime.now().strftime("[%d/%m/%Y || %H:%M]") # Отримуємо поточний час (наприклад, [11.06.2026 18:15])
        
        with open("notes.txt", "a", encoding="utf-8") as file:          # Режим "a" (Append) дописує в кінець, не видаляючи старе
            file.write(f"{time_now} {text}\n")                          # Записуємо час, текст і робимо перенос рядка через \n
        print("Нотатку збережено!")

    elif choice == "2":
        try:
            with open("notes.txt", "r", encoding="utf-8") as file:      # Відкриваємо для читання ("r")
                content = file.read()                                   # .read() зчитує весь файл одним великим текстом
                
            if len(content.strip()) == 0:                               # .strip() прибирає зайві пробіли. Перевіряємо на порожнечу
                print("Нотаток поки немає.")
            else:
                print("-==- ВСІ НОТАТКИ -==-")
                print(content)
        except FileNotFoundError:                                       # Якщо файлу notes.txt ще взагалі не існує на диску
            print("Нотаток поки немає.")

    elif choice == "3":
        try:
            with open("notes.txt", "r", encoding="utf-8") as file:
                print("--- НОТАТКИ ПО РЯДКАХ ---")
                for number, line in enumerate(file, 1):                 # Цикл бере кожен рядок, а enumerate дає йому порядковий номер
                    print(f"{number}. {line.strip()}")                  # .strip() потрібен, щоб не було подвійних порожніх рядків при виводі
        except FileNotFoundError:
            print("Нотаток поки немає.")

# ТЕОРІЯ ДО ЗАВДАННЯ (ЗБОКУ АБО В КІНЦІ):
# 1. Конструкція with open() це менеджер контексту. Вона автоматично закриває файл після закінчення блоку коду (навіть якщо сталася помилка).
# 2. З with краще, ніж з .close(), бо ти ніколи не забудеш закрити файл вручну, дані 100% збережуться і не виникне витоку пам'яті.
# 3. Режим "a" (Append) дописує нові дані в кінець файлу, зберігаючи старі. Режим "w" (Write) перед записом повністю стирає все, що було у файлі.
# 4. Метод .read() завантажує весь вміст файлу в оперативну пам'ять як один великий рядок. Цикл for line in file читає файл поступово, рядок за рядком, що набагато краще для великих файлів, бо економить оперативку.