text = input("Ваше коротке повідомлення: \n:>")

file = open("message.txt", "w", encoding="utf-8")                       # open() відкриває файл. Режим "w" (Write)  для запису. Старий вміст при цьому повністю видаляється!
file.write(text)                                                        # Записує введене повідомлення у файл
file.close()                                                            # .close() обов'язково викликати, щоб операційна система зберегла дані з буфера на диск
print("Повідомлення збережено у файл message.txt")                      # Виводить повідомлення про успішне збереження в консоль

content = open("message.txt", "r", encoding="utf-8")                    # Знову відкриває той самий файл, але в режимі "r" (Read)  суто для читання
file_text = content.read()                                              # Метод .read() зчитує весь вміст (дужки залишаємо порожніми) у змінну file_text
print(f"вміст файлу: \n:]{file_text}")                                  # Виводить зчитаний з файлу текст на екран
content.close()                                                         # Закриває файл після читання, звільняючи оперативну пам'ять