history = []                                                            # Глобальний список для збереження історії операцій

def add (a, b):
    return a + b                                                        

def substaction (a, b):
    return a - b                                                        

def multiplication (a, b):
    return a * b                                                        

def division (a, b):
    if b == 0:
        print("НЕ можливо поділити на нуль")
        return None                                                     # Повертає None, якщо виявлено спробу ділення на нуль
    else:
        return a/b                                                      # Повертає результат ділення
    
def add_to_history(text_operation):
    history.append(text_operation)                                      # Додає сформований рядок операції до списку історії

def show_history():
    if len(history) == 0:
        print("Історія операцій порожня.")                             # Повідомлення, якщо в списку ще немає записів
    else:
        print("--- ІСТОРІЯ ОПЕРАЦІЙ ---")
        for record in history:
            print(record)                                               # Почергово виводить кожен запис з історії

while True:
    print("1. Додати \n2. Відняти \n3. Помножити \n4. Поділити \n5. Показати історію \n6. ВИХІД")
    choice = input("Оберіть дію: ")
    
    if choice == "6":
        print("Вихід з програми")
        break                                                           # Завершує роботу нескінченного циклу
        
    elif choice == "5":
        show_history()                                                  # Виклик функції для відображення накопиченої історії
        
    elif choice in ["1", "2", "3", "4",]:
        num1 = float(input("Введіть перше число: "))                    # Запит першого числа для математичних операцій
        num2 = float(input("Введіть друге число: "))                    # Запит другого числа для математичних операцій
        
        if choice == "1":
            result = add(num1, num2)                                    # Виклик функції додавання
            line = f"{num1} + {num2} = {result}"                        # Формування текстового запису для історії
            print(f"Результат: {result}")
            add_to_history(line)                                        # Запис успішної операції в історію
            
        if choice == "2":
            result = substaction(num1, num2)                            # Виклик функції віднімання
            line = f"{num1} - {num2} = {result}"                        # Створення рядка результату віднімання
            print(f"{num1} - {num2} = {result}")
            add_to_history(line)                                        # Збереження результату в історію
        
        if choice == "3":
            result = multiplication(num1, num2)                         # Виклик функції множення
            line = f"{num1} * {num2} = {result}"                        # Створення рядка результату множення
            print(f"{num1} * {num2} = {result}")
            add_to_history(line)                                        # Збереження результату в історію

        if choice == "4":
            result = division(num1, num2)                               # Виклик функції ділення з перевіркою на нуль
            if result is not None:                                      # Перевірка: якщо результат обчислився (не None)
                line = f"{num1} / {num2} = {result}"                    # Створення рядка результату ділення
                print(f"{num1} / {num2} = {result}")
                add_to_history(line)                                    # Додавання до історії тільки коректного ділення

# ТЕОРІЯ ДО ЗАВДАННЯ:
# 1. Локальні змінні живуть тільки всередині функцій (як a і b). Глобальні живуть у всьому коді (як список history).
# 2. Глобальними змінними краще не зловживати, бо якщо код почне працювати неправильно, важко знайти, яка саме функція зіпсувала глобальну змінну.
# 3. Історію зручно зберігати у списку, бо список дозволяє динамічно додавати елементи (.append()) і зберігає порядок їх додавання.
# 4. Код з функціями легше читать, бо кожна функція відповідає за одну маленьку дію, і ми можемо перевикористовувати її багато разів.