def c_to_f(c):
    f = c * 9 / 5 + 32
    return f                                                            # Повертає обчислене значення у Фаренгейтах назад у програму

def f_to_c(f):
    c = (f - 32) * 5 / 9
    return c                                                            # Повертає обчислене значення у Цельсіях назад у програму

while True:
    choice = input("з чого в що переводимо (c в f / f в c) \n:>").lower() # Запит напрямку конвертації з приведенням до нижнього регістру

    if choice == "c в f":
        c = float(input("Введіть значення \n:>"))
        dc = c_to_f(c)                                                  # Збереження результату роботи функції c_to_f у змінну dc
        print(f"{c}℃ = {dc}℉")

    elif choice == "f в c":
        f = float(input("Введіть значення \n:>"))
        dc = f_to_c(f)                                                  # Передача значення f у функцію та збереження результату в dc
        print(f"{f}℉ = {dc}℃")

    else:
        print("Помилка! Неправильний вибір дії.")                       # Обробка некоректного тексту при виборі режиму

    y_n = input("Продовжуємо? (т/н) \n:>").lower()                      # Запит на повторення циклу
    if y_n in ["n", "н", "ні"]:
        print("Дякую за використання програми! Бувай!")
        break                                                           # Вихід з циклу та завершення програми
    else:
        print("-==-==-==--==-==-==-")
        print("гаразд, продовжуємо!")
        print("-==-==-==--==-==-==-")

# Окремі функції створювати краще, тому що це робить код організованим.
# Якщо в одній формулі буде помилка, її легше знайти й виправити, не чіпаючи інший код.
# На відміну від print, який просто показує текст на екрані, return дозволяє зберегти результат у змінну для подальшої роботи.